<?php
// Створіть змінну $a і присвойте їй значення 3. Виведіть значення цієї змінної на екран.
$a=3;
echo "a=" . $a . "<br>";
// Створіть змінні $a=10 і $b=2. Виведіть на екран їхню суму, різницю, добуток і частку (результат ділення).
$a=10;
$b=2;

echo "+=" . ($a + $b) . "<br>";
echo "-=" . ($a - $b) . "<br>";
echo "*=" . ($a * $b) . "<br>";
echo "/=" . ($a / $b) . "<br>";

// Створіть змінні $c=15 і $d=2. Підсумуйте їх, а результат присвойте змінній $result. Виведіть на екран значення змінної $result.
$c=15;
$d=2;
$result= $c + $d;
echo "result=" . $result . "<br>";


// Створіть змінні $a=10, $b=2 і $c=5. Виведіть на екран їхню суму.
$a=10;
$b=2;
$c=5;
echo "a+b+c=" . ($a + $b + $c) . "<br>";

// Створіть змінні $a=17 і $b=10. Відніміть від $a змінну $b і результат присвойте змінній $c. Потім створіть змінну $d, присвойте їй значення 7. Складіть змінні $c і $d, а результат запишіть у змінну $result. Виведіть на екран значення змінної $result.

$a=17;
$b=10;
$c= $a - $b;
$d=7;
$result= $c +$d;
echo "result=" . $result . "<br>";

?>